Repository: TClaudia/wp-loyalty-gamification
Catalog: languages/wc-loyalty-gamification-*.po
Languages: ro_ro

source: Loyalty Program
ro_ro: Program de Fidelitate

source: Your Loyalty Points
ro_ro: Punctele Tale de Fidelitate

source: See Your Points
ro_ro: Vezi Punctele Tale

source: points
ro_ro: puncte

source: Current Points
ro_ro: Puncte Curente

source: You need %s more points to reach your next reward!
ro_ro: Mai ai nevoie de %s puncte pentru următoarea recompensă!

source: Congratulations! You've reached 2000 points! Check your coupons for a 60% discount code.
ro_ro: Felicitări! Ai acumulat 2000 de puncte! Verifică-ți cupoanele pentru un cod de reducere de 60%.

source: You need %s more points to reach 2000 and earn a premium 60%% discount!
ro_ro: Mai ai nevoie de %s puncte pentru a ajunge la 2000 și a primi o reducere premium de 60%%!

source: Your Coupons
ro_ro: Cupoanele Tale

source: %d%% OFF
ro_ro: %d%% REDUCERE

source: Premium Reward
ro_ro: Recompensă Premium

source: Copy
ro_ro: Copiază

source: Valid for orders up to 400 lei
ro_ro: Valid pentru comenzi de până la 400 lei

source: Expired
ro_ro: Expirat

source: Used
ro_ro: Utilizat

source: Valid until %s
ro_ro: Valid până la %s

source: Notifications
ro_ro: Notificări

source: Rewards
ro_ro: Recompense

source: %d%% Discount (up to 400 lei)
ro_ro: %d%% Reducere (până la 400 lei)

source: %d%% Discount
ro_ro: %d%% Reducere

source: Free Shipping
ro_ro: Transport Gratuit

source: Claimed
ro_ro: Revendicat

source: View Coupon
ro_ro: Vezi Cupon

source: No rewards available yet.
ro_ro: Nu există recompense disponibile încă.

source: View Points History
ro_ro: Vezi Istoricul Punctelor

source: Points History
ro_ro: Istoricul Punctelor

source: No points history yet.
ro_ro: Nu există încă istoric de puncte.

source: Date
ro_ro: Data

source: Points
ro_ro: Puncte

source: Description
ro_ro: Descriere

source: Claimed Rewards
ro_ro: Recompense Revendicate

source: No rewards claimed yet.
ro_ro: Nu există încă recompense revendicate.

source: Points Level
ro_ro: Nivel de Puncte

source: Reward
ro_ro: Recompensă

source: Loyalty Program Settings
ro_ro: Setări Program de Fidelitate

source: General Settings
ro_ro: Setări Generale

source: Reward Tiers
ro_ro: Niveluri de Recompensă

source: Membership Tiers
ro_ro: Niveluri de Membru

source: Points per Euro
ro_ro: Puncte per Euro

source: Number of points awarded per euro spent on orders
ro_ro: Numărul de puncte acordate pentru fiecare euro cheltuit pe comenzi

source: Points for Product Review
ro_ro: Puncte pentru Recenzie Produs

source: Number of points awarded for product reviews (customer must have purchased the product)
ro_ro: Numărul de puncte acordate pentru recenzii de produse (clientul trebuie să fi cumpărat produsul)

source: Premium Discount Max Order Value
ro_ro: Valoarea Maximă a Comenzii pentru Reducerea Premium

source: Maximum order value (in lei) for the premium 60% discount awarded at 2000 points
ro_ro: Valoarea maximă a comenzii (în lei) pentru reducerea premium de 60% acordată la 2000 de puncte

source: Your Loyalty Coupons
ro_ro: Cupoanele Tale de Fidelitate

source: Applied
ro_ro: Aplicat

source: Apply
ro_ro: Aplică

source: Applied from Loyalty Program
ro_ro: Aplicat din Programul de Fidelitate

source: Free shipping applied from your loyalty program rewards!
ro_ro: Transport gratuit aplicat din recompensele programului de fidelitate!

source: You'll earn %d loyalty points when this order is completed. <a href="%s">View your points</a>
ro_ro: Vei câștiga %d puncte de fidelitate când această comandă va fi finalizată. <a href="%s">Vezi punctele tale</a>

source: Congratulations!
ro_ro: Felicitări!

source: You've earned a %d%% discount through our loyalty program!
ro_ro: Ai câștigat o reducere de %d%% prin programul nostru de fidelitate!

source: As a valued customer, we're excited to reward you with this special discount on your next purchase.
ro_ro: În calitate de client valoros, suntem încântați să te răsplătim cu această reducere specială la următoarea ta achiziție.

source: Your Coupon Code:
ro_ro: Codul tău de Cupon:

source: Valid until: %s
ro_ro: Valid până la: %s

source: Simply enter this code at checkout to claim your discount.
ro_ro: Introdu simplu acest cod la finalizarea comenzii pentru a beneficia de reducere.

source: Shop Now
ro_ro: Cumpără Acum

source: Thank you for being a loyal customer!
ro_ro: Îți mulțumim că ești un client fidel!

source: My Account
ro_ro: Contul Meu
